# CC_DeviceFromShape

## Description
Creates device from the given shape. The shape must be rectangle, rounded rectangle, polygon or polyline.

```pascal
PROCEDURE CC_DeviceFromShape(hObj : HANDLE);
```

```python
def vs.CC_DeviceFromShape(hObj):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObj|HANDLE|   |

## Version
Availability: from Vectorworks 2022

## Category
* ConnectCAD